--  Створіть базу даних для зберігання оцінок студентів. 
-- У базі даних створіть таблицю «Оцінки студентів», яка 
-- зберігатиме таку інформацію:
--  ■ ПІБ студента;
--  ■ місто;
--  ■ країна;
--  ■ дата народження;
--  ■ електронна адреса;
--  ■ контактний телефон;
--  ■ назва групи;
--  ■ середня оцінка за рік з усіх предметів;
--  ■ назва предмета з мінімальною, середньою оцінкою;
--  ■ назва предмета з максимальною, середньою 
-- оцінкою.
--  Наповніть цю базу даних трьома студентами
DROP TABLE GRADE_STUDENTS

CREATE TABLE GRADE_STUDENTS(
	STUDENT_ID SERIAL PRIMARY KEY,
	NAME_STUDENT VARCHAR(100),
	CITY VARCHAR(50),
	COUNTRY VARCHAR(50),
	BIRTHDAY DATE,
	EMAIL VARCHAR(50),
	TEL VARCHAR(30),
	GROUP_NAME VARCHAR(50),
	AVG_GRADE FLOAT,
	MIN_SABJECT VARCHAR(50),
	MAX_SABJECT VARCHAR(50)
	)

INSERT INTO GRADE_STUDENTS 
(NAME_STUDENT, CITY, COUNTRY, BIRTHDAY, EMAIL, TEL, GROUP_NAME, AVG_GRADE, MIN_SABJECT, MAX_SABJECT) 
VALUES
('Олександр Іваненко', 'Київ', 'Україна', '2002-05-15', 'ivanenko@mail.com', '+38067567', 'Група A', 85.5, 'Математика', 'Фізика'),
('Марія Петренко', 'Львів', 'Україна', '2003-08-21', 'petrenko@mail.com', '+380931567', 'Група B', 78.0, 'Біологія', 'Хімія'),
('Артем Коваленко', 'Одеса', 'Україна', '2001-12-10', 'kovalenko@mail.com', '+38034567', 'Група A', 90.2, 'Література', 'Інформатика'),
('Анна Сидорчук', 'Харків', 'Україна', '2000-06-05', 'sidorchuk@mail.com', '+38064567', 'Група C', 88.7, 'Історія', 'Географія'),
('Володимир Ткаченко', 'Дніпро', 'Україна', '2002-03-18', 'tkachenko@mail.com', '+31234568', 'Група B', 82.3, 'Фізика', 'Математика'),
('Олена Григоренко', 'Полтава', 'Україна', '2001-07-30', 'grigorenko@mail.com', '+91234567', 'Група A', 79.5, 'Хімія', 'Біологія'),
('Дмитро Савченко', 'Київ', 'Україна', '2003-09-14', 'savchenko@mail.com', '+3804568', 'Група C', 76.8, 'Інформатика', 'Математика'),
('Катерина Лисенко', 'Львів', 'Україна', '2000-11-25', 'lysenko@mail.com', '+384568', 'Група B', 76.8, 'Географія', 'Література'),
('Максим Бондаренко', 'Одеса', 'Україна', '2002-04-09', 'bondarenko@mail.com', '+31234568', 'Група A', 84.6, 'Література', 'Фізика'),
('Наталія Шевченко', 'Харків', 'Україна', '2001-02-17', 'shevchenko@mail.com', '+3834569', 'Група C', 80.9, 'Історія', 'Інформатика');

SELECT*
FROM GRADE_STUDENTS

--Створіть наступні запити для таблиці з оцінками 
-- студентів із попереднього завдання:
--  ■ Відображати всієї інформації з таблиці зі студентами
--  та оцінками.
--  ■ Відображати ПІБ усіх студентів.
--  ■ Відображати усіх середніх оцінок.
--  ■ Показати ПІБ усіх студентів з мінімальною оцінкою,
--  більшою, ніж зазначена.
--  ■ Показати країни студентів. Назви країн мають бути
--  унікальними.
--  ■ Показати міста студентів. Назви міст мають бути
--  унікальними.
--  ■ Показати назви груп. Назви груп мають бути уні
-- кальними.
--  ■ Показати назви усіх предметів із мінімальними се
-- редніми оцінками. Назви предметів мають бути уні
-- кальними.

 SELECT DISTINCT COUNTRY
 FROM GRADE_STUDENTS

 SELECT DISTINCT CITY
 FROM GRADE_STUDENTS

 SELECT DISTINCT GROUP_NAME
 FROM GRADE_STUDENTS

 --ІМЕНА СТУДЕНТІВ З КИЄВА
 SELECT NAME_STUDENT
 FROM GRADE_STUDENTS
 WHERE CITY ='Київ'

 --ІМЕНА СТУДЕНТІВ З КИЄВА ТА ГРУПИ А
SELECT NAME_STUDENT
FROM GRADE_STUDENTS
WHERE CITY='Київ' AND GROUP_NAME='Група A'

 --ІМЕНА, ПОШТА, ТЕЛЕФОН СТУДЕНТІВ З КИЄВА ТА ЛЬВОВА
SELECT NAME_STUDENT, EMAIL, TEL
FROM GRADE_STUDENTS
WHERE CITY='Київ' OR CITY='Львів'

--НАЙМЕНША ОЦІНКА
SELECT MIN(AVG_GRADE)
FROM GRADE_STUDENTS

--НАЙМЕНША ТА НАЙБІЛЬША ОЦІНКА ГРУПИ Б
SELECT MIN(AVG_GRADE), MAX(AVG_GRADE)
FROM GRADE_STUDENTS
WHERE GROUP_NAME='Група B'

--ІМЯ СТУДЕНТА З НАЙМЕНШОЮ ОЦІНКОЮ
SELECT NAME_STUDENT,AVG_GRADE
FROM GRADE_STUDENTS
WHERE AVG_GRADE =(
	SELECT MIN(AVG_GRADE)
	FROM GRADE_STUDENTS)

