--  Завдання 1
--  Створіть базу даних під назвою Birds. Розташування за
-- лишається на ваш вибір.
CREATE DATABASE BIRDS


--  Завдання 2
--  Переназвіть базу даних із першого завдання. Нове ім’я 
-- для бази даних Cats.
ALTER DATABASE BIRDS RENAME TO Cats

--  Завдання 3
--  Видаліть базу даних Cats.
DROP DATABASE Cats IF EXISTS Cats

--  Завдання 4
--  Створіть однотабличну базу даних «Овочі та фрукти», 
-- яка зберігатиме таку інформацію:
--  ■ Назва;
--  ■ Тип (овоч або фрукт);
--  ■ Колір;
--  ■ Калорійність;
--  ■ Короткий опис
CREATE TABLE FRUITS_AND_VEGETABLES(
	NAME_ID SERIAL PRIMARY KEY,
	NAME_VEG VARCHAR(100),
	TYPE_ID VARCHAR(100),
	COLOUR VARCHAR(100),
	CALORIAS INT,
	DESCRIPTION VARCHAR(300)
)

INSERT INTO FRUITS_AND_VEGETABLES 
(NAME_VEG, TYPE_ID, COLOUR, CALORIAS, DESCRIPTION) 
VALUES
('Яблуко', 'Фрукт', 'Червоний', 52, 'Смачний і соковитий фрукт, багатий на вітаміни.'),
('Банан', 'Фрукт', 'Жовтий', 89, 'Солодкий тропічний фрукт, багатий на калій.'),
('Морква', 'Овоч', 'Оранжевий', 41, 'Коренеплід, багатий на бета-каротин.'),
('Буряк', 'Овоч', 'Фіолетовий', 43, 'Овоч, корисний для кровообігу та очищення організму.'),
('Помідор', 'Фрукт', 'Червоний', 18, 'Соковитий продукт, багатий на лікопін.'),
('Огірок', 'Овоч', 'Зелений', 16, 'Овоч із високим вмістом води, освіжає організм.'),
('Слива', 'Фрукт', 'Фіолетовий', 46, 'Фрукт з великою кількістю антиоксидантів.'),
('Апельсин', 'Фрукт', 'Оранжевий', 47, 'Цитрусовий фрукт, багатий на вітамін C.'),
('Болгарський перець', 'Овоч', 'Жовтий', 27, 'Овоч, що містить багато вітаміну C та антиоксидантів.'),
('Ківі', 'Фрукт', 'Зелений', 61, 'Екзотичний фрукт із кисло-солодким смаком, багатий на вітамін C.');

--   Завдання 5
--  Створіть наступні запити для таблиці з інформацією про 
-- овочі та фрукти із попереднього завдання:
--  ■ Відображення всієї інформації з таблиці овочів та фруктів;
SELECT *
FROM FRUITS_AND_VEGETABLES

--  ■ Відображення усіх овочів;
SELECT NAME_VEG
FROM FRUITS_AND_VEGETABLES
WHERE TYPE_ID='Овоч'

--  ■ Відображення усіх фруктів;
SELECT NAME_VEG
FROM FRUITS_AND_VEGETABLES
WHERE TYPE_ID='Фрукт'

--  ■ Відображення усіх назв овочів та фруктів;
SELECT NAME_VEG
FROM FRUITS_AND_VEGETABLES

--  ■ Відображення усіх кольорів. Кольори мають бути уні
-- кальними;
SELECT DISTINCT COLOUR
FROM FRUITS_AND_VEGETABLES

--  ■ Відображення фруктів певного кольору;
SELECT NAME_VEG
FROM FRUITS_AND_VEGETABLES
WHERE TYPE_ID='Фрукт' AND COLOUR = 'Оранжевий'

--  ■ Відображення овочів певного кольору.
SELECT NAME_VEG
FROM FRUITS_AND_VEGETABLES
WHERE TYPE_ID='Овоч' AND COLOUR = 'Оранжевий'